export const VALIDATE = {
  hour: /(\d){2}:(\d){2}/,
  number: /[0-9]/,
  textUppercase: /[a-z]/,
  textNoUppercase: /[A-Z]/,
  dateRegex: /^(0[1-9]|[12][0-9]|3[01])\/(0[1-9]|1[0-2])\/\d{4}$/,
  phoneRegex: /^(?:\+84|84)?(0[3-9][0-9]{8})$/,
  nameRegex:
    /^[a-zA-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơĂĨŨƯƠàáảãạâầấẩẫậăằắẳẵặèéẻẽẹêềếểễệìíỉĩịòóỏõọôồốổỗộơờởỡợùúủũụưừứửữựỳýỷỹỵỸý]+( [a-zA-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơĂĨŨƯƠàáảãạâầấẩẫậăằắẳẵặèéẻẽẹêềếểễệìíỉĩịòóỏõọôồốổỗộơờởỡợùúủũụưừứửữựỳýỷỹỵỸý]+)+$/
}
